//public class useful {
//    public static void main(String[] args) {

//
//      public static void main(String[] args) {    // psvm или main точка входа (обязательно нужна)!
//      }
//_____________________________________________________________________________________________________________________
//        System.out.println(Integer.toBinaryString(число)) // (Integer.toBinaryString) переводит 10чное число
//                                                             в строку и строка ета в 2ном представлении
//                                                             т.е 10ичное в 2ичное.
//_____________________________________________________________________________________________________________________
//        System.out.println();                     // sout (быстрый вызов).
//_____________________________________________________________________________________________________________________
//        System.out.println("!");                  // "в двойные кавычки заключается объект".
//_____________________________________________________________________________________________________________________
//        System.out.println(new Random().nextInt(1000));     //  (генератор случайных чисел от 0 до 1000).
//_____________________________________________________________________________________________________________________
//    scanner = new Scanner(System.in);
//
//    String ma = scanner.nextLine();
//    String ms = scanner.nextLine();            // Упрощенный ввод сканером (scanner).
//    String md = scanner.nextLine();
//    String mf = scanner.nextLine();
//
//    System.out.println(ma+ms+md+mf);

//_____________________________________________________________________________________________________________________

//_____________________________________________________________________________________________________________________
//
//        System.out.println("=".repeat(30));                  // выводит строчку из символов ============.
//                                                             //(символ = в "" число кол-во символов)
//_____________________________________________________________________________________________________________________
//       ArrayList<Integer> list = new ArrayList<>();
//            for (int i = 0; i < 10; i++) {
//                list.add(new Random().nextInt(100));
//            }                                                // создание рандомного списка.
//            System.out.print("Созданный список: ");
//            System.out.println(list);
//_____________________________________________________________________________________________________________________
//        list.sort(Comparator.naturalOrder());
//        System.out.print("Отсортированный список: ");       // Сортировка списка.
//        System.out.println(list);
//_____________________________________________________________________________________________________________________
//        Iterator<Integer> iterator = list.iterator();
//        while (iterator.hasNext()) {
//            int num = iterator.next();
//            if (num % 2 == 0) {
//                iterator.remove();                          // Удаление четных чисел из списка.
//            }                                               // (в списке остаются нечетные числа).
//        }
//        System.out.print("Список c удаленными четными "нечетными" числами: ");
//        System.out.println(list);
//_____________________________________________________________________________________________________________________
//
//
//        int minValue = list.get(0);                          // Ищем минимальное значение.
//        System.out.println("Минимальное значение: " + minValue);
//
//_____________________________________________________________________________________________________________________
//        int maxValue = list.get(list.size() - 1);            // Ищем максимальное значение.
//        System.out.println("Максимальное значение: " + maxValue);
//
//_____________________________________________________________________________________________________________________
//        int average = list.get(list.size() / 2);             // Ищем среднее значение.
//        System.out.println("Среднее значение: " + average);






//    }
//}
