public class useful {
    public static void main(String[] args) {


//        System.out.println("=".repeat(30));                  // выводит строчку из символов ============.
//                                                             //(символ = в "" число кол-во символов)
//_____________________________________________________________________________________________________________________
//       ArrayList<Integer> list = new ArrayList<>();
//            for (int i = 0; i < 10; i++) {
//                list.add(new Random().nextInt(100));
//            }                                                // создание рандомного списка.
//            System.out.print("Созданный список: ");
//            System.out.println(list);
//_____________________________________________________________________________________________________________________
//        list.sort(Comparator.naturalOrder());
//        System.out.print("Отсортированный список: ");       // Сортировка списка.
//        System.out.println(list);
//_____________________________________________________________________________________________________________________
//        Iterator<Integer> iterator = list.iterator();
//        while (iterator.hasNext()) {
//            int num = iterator.next();
//            if (num % 2 == 0) {
//                iterator.remove();                          // Удаление четных чисел из списка.
//            }                                               // (в списке остаются нечетные числа).
//        }
//        System.out.print("Список c удаленными четными "нечетными" числами: ");
//        System.out.println(list);
//_____________________________________________________________________________________________________________________
//
//
//        int minValue = list.get(0);                          // Ищем минимальное значение.
//        System.out.println("Минимальное значение: " + minValue);
//
//_____________________________________________________________________________________________________________________
//        int maxValue = list.get(list.size() - 1);            // Ищем максимальное значение.
//        System.out.println("Максимальное значение: " + maxValue);
//
//_____________________________________________________________________________________________________________________
//        int average = list.get(list.size() / 2);             // Ищем среднее значение.
//        System.out.println("Среднее значение: " + average);






    }
}
